In [36]:
import pandas as pd

In [37]:
df=pd.read_excel('./Datasets/datac.xlsx')

In [38]:
df

     Name       Date  Marks  Experience  Qualification
0  Nabeel 2020-12-01    NaN         3.0            2.0
1     Ali 2020-12-02  450.0         4.0            1.0
2   Ahmad 2020-12-03  350.0         5.0            NaN
3   Maria        NaT  300.0         2.0            2.0
4   Aamir 2020-12-05  489.0         NaN            1.0

In [39]:
# df.fillna(30, inplace=True)

In [40]:
# df

In [41]:
x=df['Date'].mode()

In [42]:
df['Date'].fillna(x, inplace=True)

In [43]:
df

     Name       Date  Marks  Experience  Qualification
0  Nabeel 2020-12-01    NaN         3.0            2.0
1     Ali 2020-12-02  450.0         4.0            1.0
2   Ahmad 2020-12-03  350.0         5.0            NaN
3   Maria 2020-12-05  300.0         2.0            2.0
4   Aamir 2020-12-05  489.0         NaN            1.0

In [44]:
df

     Name       Date  Marks  Experience  Qualification
0  Nabeel 2020-12-01    NaN         3.0            2.0
1     Ali 2020-12-02  450.0         4.0            1.0
2   Ahmad 2020-12-03  350.0         5.0            NaN
3   Maria 2020-12-05  300.0         2.0            2.0
4   Aamir 2020-12-05  489.0         NaN            1.0

In [45]:
df['Date']=pd.to_datetime(df['Date'])

In [46]:
df

     Name       Date  Marks  Experience  Qualification
0  Nabeel 2020-12-01    NaN         3.0            2.0
1     Ali 2020-12-02  450.0         4.0            1.0
2   Ahmad 2020-12-03  350.0         5.0            NaN
3   Maria 2020-12-05  300.0         2.0            2.0
4   Aamir 2020-12-05  489.0         NaN            1.0

In [47]:
df.dropna(subset=['Date'], inplace=True)

In [48]:
df

     Name       Date  Marks  Experience  Qualification
0  Nabeel 2020-12-01    NaN         3.0            2.0
1     Ali 2020-12-02  450.0         4.0            1.0
2   Ahmad 2020-12-03  350.0         5.0            NaN
3   Maria 2020-12-05  300.0         2.0            2.0
4   Aamir 2020-12-05  489.0         NaN            1.0

In [49]:
df

     Name       Date  Marks  Experience  Qualification
0  Nabeel 2020-12-01    NaN         3.0            2.0
1     Ali 2020-12-02  450.0         4.0            1.0
2   Ahmad 2020-12-03  350.0         5.0            NaN
3   Maria 2020-12-05  300.0         2.0            2.0
4   Aamir 2020-12-05  489.0         NaN            1.0

In [50]:
df['Date'] = df['Date'].dt.strftime('%m-%d-%Y')

In [51]:
df

     Name        Date  Marks  Experience  Qualification
0  Nabeel  12-01-2020    NaN         3.0            2.0
1     Ali  12-02-2020  450.0         4.0            1.0
2   Ahmad  12-03-2020  350.0         5.0            NaN
3   Maria  12-05-2020  300.0         2.0            2.0
4   Aamir  12-05-2020  489.0         NaN            1.0

### for : if : if else:

In [52]:
for x in df.index:
    if df.loc[x, "Marks"]>=489:
        df.loc[x,"Marks"]=490

In [53]:
df

     Name        Date  Marks  Experience  Qualification
0  Nabeel  12-01-2020    NaN         3.0            2.0
1     Ali  12-02-2020  450.0         4.0            1.0
2   Ahmad  12-03-2020  350.0         5.0            NaN
3   Maria  12-05-2020  300.0         2.0            2.0
4   Aamir  12-05-2020  490.0         NaN            1.0

In [112]:
for x in df.index:
    if df.loc[x, "Marks"]>=300:
        df.drop(x,inplace=True)

In [113]:
df

     Name       Date  Marks  Experience  Qualification
0  Nabeel 2020-12-01    NaN         3.0            2.0

In [117]:
df.corr()

                 Marks  Experience  Qualification
Marks          1.00000    0.500000      -0.980720
Experience     0.50000    1.000000      -0.866025
Qualification -0.98072   -0.866025       1.000000

In [118]:
df.mean()

<ipython-input-118-c61f0c8f89b5>:1: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  df.mean()

Marks            397.25
Experience         3.50
Qualification      1.50
dtype: float64

In [ ]:
df33=pd.read_excel()